In [2]:
#q1
import pandas as pd
l=[4, 8, 15, 16, 23, 42]
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#q2
l1=[1,2,3,4,5,6,7,89,78]
pd.Series(l1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7    89
8    78
dtype: int64

In [5]:
#q3
dc={
    'Name':['Alice','Bob','Claire'],
    'Age': [25,30,27],
    'Gender':['Female','Male','Female']
}
pd.DataFrame(dc)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
#q3
#dataframe are 2 -d array of pandas used for the data analysis ,library of python 
#it can save hetrogeneous and complex data
dc={
    'Name':['Alice','Bob','Claire'],
    'Age': [25,30,27],
    'Gender':['Female','Male','Female']
}
pd.DataFrame(dc)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
#Series is 1-d array of used for data analysis ,library of python
#It can handle only homogeneous and simple data
import pandas as pd
l=[4, 8, 15, 16, 23, 42]
pd.Series(l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
#q4
#data manipulation functions are used for for organizing data for the data includes cleaning,handling misssing values for the better insight extraction process

In [16]:
data=pd.read_csv("student.csv")
#used for viewing data from the top upto an extent by putting value in head

In [18]:
data.head(3)
#used for viewing data from the top upto an extent by putting value in head

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [19]:
data.tail(3)
#used for viewing data from the bottom upto an extent by putting value in tail

    id        name  class  mark  gender
32  33   Kenn Rein    Six    96  female
33  34    Gain Toe  Seven    69    male
34  35  Rows Noump    Six    88  female

In [23]:
data.nunique()
#nunique tells us the number of unique values in each column

id        35
name      35
class      8
mark      17
gender     2
dtype: int64

In [25]:
data.describe()
#it tells us about the bit of statistical data of the integer data types

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [27]:
data.info()
#it provide brief information of the data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

In [28]:
#q6
#dataframes are mutable in nature

In [39]:

dc={
    'Name':pd.Series(['Alice','Bob','Claire']),
    'Age': pd.Series([25,30,27]),
    'Gender':pd.Series(['Female','Male','Female'])
}
data1=d

AttributeError: 'list' object has no attribute 'to_frame'

In [31]:
a

0    25
1    30
2    27
dtype: int64

0    f
1    m
2    f
dtype: object